[Killed] BlockStatement
testing/se_js_hut_practice/src/easy.js:4:28
 
 /* eslint-disable no-undef */
 const $= require('jquery');
-function setViewMode(mode) {
-    var modes = ['content', 'details', 'about'];
-    var container = $('.jq-trending-analytics');
-    for (var i in modes) {
-        container.removeClass('schlum-' + modes[i]);
-    }
-    container.addClass('schlum-' + mode);
-}
+function setViewMode(mode) {}
 
 function getTrendingAnalyticsL2Details(graph, node) {

[Survived] StringLiteral
testing/se_js_hut_practice/src/easy.js:5:40
 /* eslint-disable no-undef */
 const $= require('jquery');
 function setViewMode(mode) {
-    var modes = ['content', 'details', 'about'];
+    var modes = ['content', 'details', ""];
     var container = $('.jq-trending-analytics');
     for (var i in modes) {

[Killed] StringLiteral
testing/se_js_hut_practice/src/easy.js:6:23
 const $= require('jquery');
 function setViewMode(mode) {
     var modes = ['content', 'details', 'about'];
-    var container = $('.jq-trending-analytics');
+    var container = $("");
     for (var i in modes) {
         container.removeClass('schlum-' + modes[i]);

[Survived] BlockStatement
testing/se_js_hut_practice/src/easy.js:7:26
 function setViewMode(mode) {
     var modes = ['content', 'details', 'about'];
     var container = $('.jq-trending-analytics');
-    for (var i in modes) {
-        container.removeClass('schlum-' + modes[i]);
-    }
+    for (var i in modes) {}
     container.addClass('schlum-' + mode);
 }

[Survived] ArithmeticOperator
testing/se_js_hut_practice/src/easy.js:8:31
     var modes = ['content', 'details', 'about'];
     var container = $('.jq-trending-analytics');
     for (var i in modes) {
-        container.removeClass('schlum-' + modes[i]);
+        container.removeClass('schlum-' - modes[i]);
     }
     container.addClass('schlum-' + mode);

[Survived] StringLiteral
testing/se_js_hut_practice/src/easy.js:8:31
     var modes = ['content', 'details', 'about'];
     var container = $('.jq-trending-analytics');
     for (var i in modes) {
-        container.removeClass('schlum-' + modes[i]);
+        container.removeClass("" + modes[i]);
     }
     container.addClass('schlum-' + mode);

[Killed] ArithmeticOperator
testing/se_js_hut_practice/src/easy.js:10:24
     for (var i in modes) {
         container.removeClass('schlum-' + modes[i]);
     }
-    container.addClass('schlum-' + mode);
+    container.addClass('schlum-' - mode);
 }
 

[Killed] BlockStatement
testing/se_js_hut_practice/src/easy.js:13:53
     container.addClass('schlum-' + mode);
 }
 
-function getTrendingAnalyticsL2Details(graph, node) {
-    var detailsElement = $('.jq-schlum-details').html('');
-    $('.jq-entity-name').html(node.label);
-    setViewMode('details');
-    addLoadingImg(detailsElement, 'fr-spnr');
-    $.get(
-        'schlum-trending-analytics-web-result',
-        {
-            token: FREnv.token,
-            email: FREnv.email,
-            query: node.searchToken,
-            entityName: node.label,
-        },
-        function (html) {
-            detailsElement.html(html);
-        }
-    );
-}
+function getTrendingAnalyticsL2Details(graph, node) {}
 
 exports.setViewMode = setViewMode;

[Survived] StringLiteral
testing/se_js_hut_practice/src/easy.js:14:55
 }
 
 function getTrendingAnalyticsL2Details(graph, node) {
-    var detailsElement = $('.jq-schlum-details').html('');
+    var detailsElement = $('.jq-schlum-details').html("Stryker was here!");
     $('.jq-entity-name').html(node.label);
     setViewMode('details');

[Killed] StringLiteral
testing/se_js_hut_practice/src/easy.js:15:7
 
 function getTrendingAnalyticsL2Details(graph, node) {
     var detailsElement = $('.jq-schlum-details').html('');
-    $('.jq-entity-name').html(node.label);
+    $("").html(node.label);
     setViewMode('details');
     addLoadingImg(detailsElement, 'fr-spnr');

[Survived] StringLiteral
testing/se_js_hut_practice/src/easy.js:19:9
     setViewMode('details');
     addLoadingImg(detailsElement, 'fr-spnr');
     $.get(
-        'schlum-trending-analytics-web-result',
+        "",
         {
             token: FREnv.token,

[Killed] BlockStatement
testing/se_js_hut_practice/src/easy.js:26:25
             query: node.searchToken,
             entityName: node.label,
         },
-        function (html) {
-            detailsElement.html(html);
-        }
+        function (html) {}
     );
 }
