[Killed] StringLiteral
testing/se_js_hut_practice/src/hard.js:4:42
 const $ = require('jquery');
 var app = angular.module('frDirectives', []);
 
-angular.module('frDirectives').directive('manageQuickViews', function() {
+angular.module('frDirectives').directive("", function() {
     return {
         restrict: 'E',

[Killed] StringLiteral
testing/se_js_hut_practice/src/hard.js:8:22
     return {
         restrict: 'E',
         scope: {
-            'views': '=',
+            'views': "",
             'isMobileView': '=',
             'removeQuickViewFilter': '&',

[Killed] StringLiteral
testing/se_js_hut_practice/src/hard.js:10:38
         scope: {
             'views': '=',
             'isMobileView': '=',
-            'removeQuickViewFilter': '&',
+            'removeQuickViewFilter': "",
             'updateStreamQuickView': '&',
             'selectedQuickView': '='

[Killed] StringLiteral
testing/se_js_hut_practice/src/hard.js:14:32
             'updateStreamQuickView': '&',
             'selectedQuickView': '='
         },
-        controller: ['$scope', '$http' ,'$timeout', function($scope, $http, setTimeout) {
+        controller: ['$scope', "" ,'$timeout', function($scope, $http, setTimeout) {
 
             $scope.rename = function(id) {

[Killed] BlockStatement
testing/se_js_hut_practice/src/hard.js:16:42
         },
         controller: ['$scope', '$http' ,'$timeout', function($scope, $http, setTimeout) {
 
-            $scope.rename = function(id) {
-                $('.jq-name-' + id).hide();
-                $('.jq-tb-a-' + id).show();
-                $('.jq-tb-' + id).focus();
-            };
+            $scope.rename = function(id) {};
 
             $scope.enter = function(id) {

[Killed] ArithmeticOperator
testing/se_js_hut_practice/src/hard.js:17:19
         controller: ['$scope', '$http' ,'$timeout', function($scope, $http, setTimeout) {
 
             $scope.rename = function(id) {
-                $('.jq-name-' + id).hide();
+                $('.jq-name-' - id).hide();
                 $('.jq-tb-a-' + id).show();
                 $('.jq-tb-' + id).focus();

[Survived] ArithmeticOperator
testing/se_js_hut_practice/src/hard.js:18:19
 
             $scope.rename = function(id) {
                 $('.jq-name-' + id).hide();
-                $('.jq-tb-a-' + id).show();
+                $('.jq-tb-a-' - id).show();
                 $('.jq-tb-' + id).focus();
             };

[Survived] StringLiteral
testing/se_js_hut_practice/src/hard.js:18:19
 
             $scope.rename = function(id) {
                 $('.jq-name-' + id).hide();
-                $('.jq-tb-a-' + id).show();
+                $("" + id).show();
                 $('.jq-tb-' + id).focus();
             };

[Survived] ArithmeticOperator
testing/se_js_hut_practice/src/hard.js:19:19
             $scope.rename = function(id) {
                 $('.jq-name-' + id).hide();
                 $('.jq-tb-a-' + id).show();
-                $('.jq-tb-' + id).focus();
+                $('.jq-tb-' - id).focus();
             };
 

[Survived] BlockStatement
testing/se_js_hut_practice/src/hard.js:22:41
                 $('.jq-tb-' + id).focus();
             };
 
-            $scope.enter = function(id) {
-                $('.jq-tb-' + id).blur();
-            };
+            $scope.enter = function(id) {};
 
             $scope.renameText = function(event) {

[Survived] ArithmeticOperator
testing/se_js_hut_practice/src/hard.js:23:19
             };
 
             $scope.enter = function(id) {
-                $('.jq-tb-' + id).blur();
+                $('.jq-tb-' - id).blur();
             };
 

[Killed] BlockStatement
testing/se_js_hut_practice/src/hard.js:26:49
                 $('.jq-tb-' + id).blur();
             };
 
-            $scope.renameText = function(event) {
-                var _this = $(event.target);
-                var id = _this.attr('_id');
-                $('.jq-tb-a-' + id).hide();
-                $('.jq-name-' + id).show();
-
-                $scope.updateStreamQuickView({'event': event, 'id': id});
-            };
+            $scope.renameText = function(event) {};
 
             $scope.allResMarkDef = true;

[Killed] ArithmeticOperator
testing/se_js_hut_practice/src/hard.js:29:19
             $scope.renameText = function(event) {
                 var _this = $(event.target);
                 var id = _this.attr('_id');
-                $('.jq-tb-a-' + id).hide();
+                $('.jq-tb-a-' - id).hide();
                 $('.jq-name-' + id).show();
 

[Killed] StringLiteral
testing/se_js_hut_practice/src/hard.js:29:19
             $scope.renameText = function(event) {
                 var _this = $(event.target);
                 var id = _this.attr('_id');
-                $('.jq-tb-a-' + id).hide();
+                $("" + id).hide();
                 $('.jq-name-' + id).show();
 

[Survived] ArithmeticOperator
testing/se_js_hut_practice/src/hard.js:30:19
                 var _this = $(event.target);
                 var id = _this.attr('_id');
                 $('.jq-tb-a-' + id).hide();
-                $('.jq-name-' + id).show();
+                $('.jq-name-' - id).show();
 
                 $scope.updateStreamQuickView({'event': event, 'id': id});

[Survived] StringLiteral
testing/se_js_hut_practice/src/hard.js:30:19
                 var _this = $(event.target);
                 var id = _this.attr('_id');
                 $('.jq-tb-a-' + id).hide();
-                $('.jq-name-' + id).show();
+                $("" + id).show();
 
                 $scope.updateStreamQuickView({'event': event, 'id': id});

[Survived] StringLiteral
testing/se_js_hut_practice/src/hard.js:32:63
                 $('.jq-tb-a-' + id).hide();
                 $('.jq-name-' + id).show();
 
-                $scope.updateStreamQuickView({'event': event, 'id': id});
+                $scope.updateStreamQuickView({'event': event, "": id});
             };
 

[Killed] BooleanLiteral
testing/se_js_hut_practice/src/hard.js:35:36
                 $scope.updateStreamQuickView({'event': event, 'id': id});
             };
 
-            $scope.allResMarkDef = true;
+            $scope.allResMarkDef = false;
             for (var i in $scope.views) {
                 

[Survived] BlockStatement
testing/se_js_hut_practice/src/hard.js:36:41
             };
 
             $scope.allResMarkDef = true;
-            for (var i in $scope.views) {
-                
-                var view = $scope.views[i];
-                if (view['default']) {
-                    $scope.allResMarkDef = false;
-                    break;
-                }
-            }
+            for (var i in $scope.views) {}
 
             $scope.unMarkQuickViewAsDefault = function() {

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:39:21
             for (var i in $scope.views) {
                 
                 var view = $scope.views[i];
-                if (view['default']) {
+                if (true) {
                     $scope.allResMarkDef = false;
                     break;

[Survived] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:39:21
             for (var i in $scope.views) {
                 
                 var view = $scope.views[i];
-                if (view['default']) {
+                if (false) {
                     $scope.allResMarkDef = false;
                     break;

[Survived] BooleanLiteral
testing/se_js_hut_practice/src/hard.js:40:44
                 
                 var view = $scope.views[i];
                 if (view['default']) {
-                    $scope.allResMarkDef = false;
+                    $scope.allResMarkDef = true;
                     break;
                 }

[Killed] BlockStatement
testing/se_js_hut_practice/src/hard.js:48:45
             $scope.unMarkQuickViewAsDefault = function() {
 
                 var id = null;
-                for (var i in $scope.views) {
-                    var view = $scope.views[i];
-                    if (view['default']) {
-                        id = view.id;
-                        break;
-                    }
-                }
+                for (var i in $scope.views) {}
 
                 var params = {'quickViewId': id, 'unMarkDefault': true};

[Killed] BlockStatement
testing/se_js_hut_practice/src/hard.js:50:42
                 var id = null;
                 for (var i in $scope.views) {
                     var view = $scope.views[i];
-                    if (view['default']) {
-                        id = view.id;
-                        break;
-                    }
+                    if (view['default']) {}
                 }
 

[Killed] BooleanLiteral
testing/se_js_hut_practice/src/hard.js:56:67
                     }
                 }
 
-                var params = {'quickViewId': id, 'unMarkDefault': true};
+                var params = {'quickViewId': id, 'unMarkDefault': false};
                 if (FREnv.$rootScope.channelSubViewToRender) {
                     params.parentChannelId = FREnv.$rootScope.channelToRender.id;

[Killed] StringLiteral
testing/se_js_hut_practice/src/hard.js:56:31
                     }
                 }
 
-                var params = {'quickViewId': id, 'unMarkDefault': true};
+                var params = {"": id, 'unMarkDefault': true};
                 if (FREnv.$rootScope.channelSubViewToRender) {
                     params.parentChannelId = FREnv.$rootScope.channelToRender.id;

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:57:21
                 }
 
                 var params = {'quickViewId': id, 'unMarkDefault': true};
-                if (FREnv.$rootScope.channelSubViewToRender) {
+                if (false) {
                     params.parentChannelId = FREnv.$rootScope.channelToRender.id;
                 }

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:57:21
                 }
 
                 var params = {'quickViewId': id, 'unMarkDefault': true};
-                if (FREnv.$rootScope.channelSubViewToRender) {
+                if (true) {
                     params.parentChannelId = FREnv.$rootScope.channelToRender.id;
                 }

[Survived] StringLiteral
testing/se_js_hut_practice/src/hard.js:62:67
                 }
                 var shareInfo = getShareByUserTrack(FREnv.$rootScope.channelToRender);
                 usageTrackingCall(
-                    'unmarkdefaultquickview', params.quickViewId, 'stream', null, null, shareInfo.ss, 'quickview',
+                    'unmarkdefaultquickview', params.quickViewId, "", null, null, shareInfo.ss, 'quickview',
                     FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
                     null, null, shareInfo.ssi);

[Survived] ArithmeticOperator
testing/se_js_hut_practice/src/hard.js:63:67
                 var shareInfo = getShareByUserTrack(FREnv.$rootScope.channelToRender);
                 usageTrackingCall(
                     'unmarkdefaultquickview', params.quickViewId, 'stream', null, null, shareInfo.ss, 'quickview',
-                    FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
+                    FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix - FREnv.$rootScope.channelToRender.id,
                     null, null, shareInfo.ssi);
                 $http.get('markQuickViewAsDefault', {'params': params})

[Killed] ObjectLiteral
testing/se_js_hut_practice/src/hard.js:65:53
                     'unmarkdefaultquickview', params.quickViewId, 'stream', null, null, shareInfo.ss, 'quickview',
                     FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
                     null, null, shareInfo.ssi);
-                $http.get('markQuickViewAsDefault', {'params': params})
+                $http.get('markQuickViewAsDefault', {})
                     .success(function(res) {
                         if (res && res.status == 'SUCCESS') {

[Survived] BlockStatement
testing/se_js_hut_practice/src/hard.js:66:44
                     FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
                     null, null, shareInfo.ssi);
                 $http.get('markQuickViewAsDefault', {'params': params})
-                    .success(function(res) {
-                        if (res && res.status == 'SUCCESS') {
-                            for (var i in $scope.views) {
-                                var view = $scope.views[i];
-                                view['default'] = false;
-                            }
-                            $scope.allResMarkDef = true;
-                            successMessageSeachAdded('quick.view.saved.default');
-                        }
-                    });
+                    .success(function(res) {});
             };
 

[Survived] EqualityOperator
testing/se_js_hut_practice/src/hard.js:67:36
                     null, null, shareInfo.ssi);
                 $http.get('markQuickViewAsDefault', {'params': params})
                     .success(function(res) {
-                        if (res && res.status == 'SUCCESS') {
+                        if (res && res.status != 'SUCCESS') {
                             for (var i in $scope.views) {
                                 var view = $scope.views[i];

[Survived] BlockStatement
testing/se_js_hut_practice/src/hard.js:67:61
                     null, null, shareInfo.ssi);
                 $http.get('markQuickViewAsDefault', {'params': params})
                     .success(function(res) {
-                        if (res && res.status == 'SUCCESS') {
-                            for (var i in $scope.views) {
-                                var view = $scope.views[i];
-                                view['default'] = false;
-                            }
-                            $scope.allResMarkDef = true;
-                            successMessageSeachAdded('quick.view.saved.default');
-                        }
+                        if (res && res.status == 'SUCCESS') {}
                     });
             };

[Survived] BlockStatement
testing/se_js_hut_practice/src/hard.js:68:57
                 $http.get('markQuickViewAsDefault', {'params': params})
                     .success(function(res) {
                         if (res && res.status == 'SUCCESS') {
-                            for (var i in $scope.views) {
-                                var view = $scope.views[i];
-                                view['default'] = false;
-                            }
+                            for (var i in $scope.views) {}
                             $scope.allResMarkDef = true;
                             successMessageSeachAdded('quick.view.saved.default');

[Survived] BooleanLiteral
testing/se_js_hut_practice/src/hard.js:70:51
                         if (res && res.status == 'SUCCESS') {
                             for (var i in $scope.views) {
                                 var view = $scope.views[i];
-                                view['default'] = false;
+                                view['default'] = true;
                             }
                             $scope.allResMarkDef = true;

[Survived] BooleanLiteral
testing/se_js_hut_practice/src/hard.js:72:52
                                 var view = $scope.views[i];
                                 view['default'] = false;
                             }
-                            $scope.allResMarkDef = true;
+                            $scope.allResMarkDef = false;
                             successMessageSeachAdded('quick.view.saved.default');
                         }

[Survived] StringLiteral
testing/se_js_hut_practice/src/hard.js:73:54
                                 view['default'] = false;
                             }
                             $scope.allResMarkDef = true;
-                            successMessageSeachAdded('quick.view.saved.default');
+                            successMessageSeachAdded("");
                         }
                     });

[Killed] BlockStatement
testing/se_js_hut_practice/src/hard.js:78:58
                     });
             };
 
-            $scope.markQuickViewAsDefault = function(id) {
-                var params = {'quickViewId': id, 'markAsDefault': true};
-                if (FREnv.$rootScope.channelSubViewToRender) {
-                    params.parentChannelId = FREnv.$rootScope.channelToRender.id;
-                }
-                var shareInfo = getShareByUserTrack(FREnv.$rootScope.channelToRender);
-                usageTrackingCall(
-                    'savedefaultquickview', params.quickViewId, 'stream', null, null, shareInfo.ss, 'quickview',
-                    FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
-                    null, null, shareInfo.ssi);
-                $http.get('markQuickViewAsDefault', {'params': params})
-                    .success(function(res) {
-                        if (res && res.status == 'SUCCESS') {
-                            for (var i in $scope.views) {
-                                var view = $scope.views[i];
-                                view['default'] = false;
-                                if (view.id == id) {
-                                    $scope.allResMarkDef = false;
-                                    view['default'] = true;
-                                }
-                            }
-                            successMessageSeachAdded('quick.view.saved.default');
-                        }
-                    });
-            };
+            $scope.markQuickViewAsDefault = function(id) {};
 
             $scope.deleteQuickViews = function(id) {

[Killed] BooleanLiteral
testing/se_js_hut_practice/src/hard.js:79:67
             };
 
             $scope.markQuickViewAsDefault = function(id) {
-                var params = {'quickViewId': id, 'markAsDefault': true};
+                var params = {'quickViewId': id, 'markAsDefault': false};
                 if (FREnv.$rootScope.channelSubViewToRender) {
                     params.parentChannelId = FREnv.$rootScope.channelToRender.id;

[Killed] StringLiteral
testing/se_js_hut_practice/src/hard.js:79:31
             };
 
             $scope.markQuickViewAsDefault = function(id) {
-                var params = {'quickViewId': id, 'markAsDefault': true};
+                var params = {"": id, 'markAsDefault': true};
                 if (FREnv.$rootScope.channelSubViewToRender) {
                     params.parentChannelId = FREnv.$rootScope.channelToRender.id;

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:80:21
 
             $scope.markQuickViewAsDefault = function(id) {
                 var params = {'quickViewId': id, 'markAsDefault': true};
-                if (FREnv.$rootScope.channelSubViewToRender) {
+                if (true) {
                     params.parentChannelId = FREnv.$rootScope.channelToRender.id;
                 }

[Survived] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:80:21
 
             $scope.markQuickViewAsDefault = function(id) {
                 var params = {'quickViewId': id, 'markAsDefault': true};
-                if (FREnv.$rootScope.channelSubViewToRender) {
+                if (false) {
                     params.parentChannelId = FREnv.$rootScope.channelToRender.id;
                 }

[Survived] StringLiteral
testing/se_js_hut_practice/src/hard.js:85:21
                 }
                 var shareInfo = getShareByUserTrack(FREnv.$rootScope.channelToRender);
                 usageTrackingCall(
-                    'savedefaultquickview', params.quickViewId, 'stream', null, null, shareInfo.ss, 'quickview',
+                    "", params.quickViewId, 'stream', null, null, shareInfo.ss, 'quickview',
                     FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
                     null, null, shareInfo.ssi);

[Survived] StringLiteral
testing/se_js_hut_practice/src/hard.js:85:65
                 }
                 var shareInfo = getShareByUserTrack(FREnv.$rootScope.channelToRender);
                 usageTrackingCall(
-                    'savedefaultquickview', params.quickViewId, 'stream', null, null, shareInfo.ss, 'quickview',
+                    'savedefaultquickview', params.quickViewId, "", null, null, shareInfo.ss, 'quickview',
                     FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
                     null, null, shareInfo.ssi);

[Survived] ArithmeticOperator
testing/se_js_hut_practice/src/hard.js:86:67
                 var shareInfo = getShareByUserTrack(FREnv.$rootScope.channelToRender);
                 usageTrackingCall(
                     'savedefaultquickview', params.quickViewId, 'stream', null, null, shareInfo.ss, 'quickview',
-                    FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
+                    FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix - FREnv.$rootScope.channelToRender.id,
                     null, null, shareInfo.ssi);
                 $http.get('markQuickViewAsDefault', {'params': params})

[Killed] StringLiteral
testing/se_js_hut_practice/src/hard.js:88:54
                     'savedefaultquickview', params.quickViewId, 'stream', null, null, shareInfo.ss, 'quickview',
                     FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
                     null, null, shareInfo.ssi);
-                $http.get('markQuickViewAsDefault', {'params': params})
+                $http.get('markQuickViewAsDefault', {"": params})
                     .success(function(res) {
                         if (res && res.status == 'SUCCESS') {

[Killed] StringLiteral
testing/se_js_hut_practice/src/hard.js:88:27
                     'savedefaultquickview', params.quickViewId, 'stream', null, null, shareInfo.ss, 'quickview',
                     FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
                     null, null, shareInfo.ssi);
-                $http.get('markQuickViewAsDefault', {'params': params})
+                $http.get("", {'params': params})
                     .success(function(res) {
                         if (res && res.status == 'SUCCESS') {

[Killed] BlockStatement
testing/se_js_hut_practice/src/hard.js:89:44
                     FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
                     null, null, shareInfo.ssi);
                 $http.get('markQuickViewAsDefault', {'params': params})
-                    .success(function(res) {
-                        if (res && res.status == 'SUCCESS') {
-                            for (var i in $scope.views) {
-                                var view = $scope.views[i];
-                                view['default'] = false;
-                                if (view.id == id) {
-                                    $scope.allResMarkDef = false;
-                                    view['default'] = true;
-                                }
-                            }
-                            successMessageSeachAdded('quick.view.saved.default');
-                        }
-                    });
+                    .success(function(res) {});
             };
 

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:90:36
                     null, null, shareInfo.ssi);
                 $http.get('markQuickViewAsDefault', {'params': params})
                     .success(function(res) {
-                        if (res && res.status == 'SUCCESS') {
+                        if (res && true) {
                             for (var i in $scope.views) {
                                 var view = $scope.views[i];

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:90:36
                     null, null, shareInfo.ssi);
                 $http.get('markQuickViewAsDefault', {'params': params})
                     .success(function(res) {
-                        if (res && res.status == 'SUCCESS') {
+                        if (res && false) {
                             for (var i in $scope.views) {
                                 var view = $scope.views[i];

[Killed] BlockStatement
testing/se_js_hut_practice/src/hard.js:91:57
                 $http.get('markQuickViewAsDefault', {'params': params})
                     .success(function(res) {
                         if (res && res.status == 'SUCCESS') {
-                            for (var i in $scope.views) {
-                                var view = $scope.views[i];
-                                view['default'] = false;
-                                if (view.id == id) {
-                                    $scope.allResMarkDef = false;
-                                    view['default'] = true;
-                                }
-                            }
+                            for (var i in $scope.views) {}
                             successMessageSeachAdded('quick.view.saved.default');
                         }

[Killed] EqualityOperator
testing/se_js_hut_practice/src/hard.js:94:37
                             for (var i in $scope.views) {
                                 var view = $scope.views[i];
                                 view['default'] = false;
-                                if (view.id == id) {
+                                if (view.id != id) {
                                     $scope.allResMarkDef = false;
                                     view['default'] = true;

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:94:37
                             for (var i in $scope.views) {
                                 var view = $scope.views[i];
                                 view['default'] = false;
-                                if (view.id == id) {
+                                if (true) {
                                     $scope.allResMarkDef = false;
                                     view['default'] = true;

[Survived] BooleanLiteral
testing/se_js_hut_practice/src/hard.js:95:60
                                 var view = $scope.views[i];
                                 view['default'] = false;
                                 if (view.id == id) {
-                                    $scope.allResMarkDef = false;
+                                    $scope.allResMarkDef = true;
                                     view['default'] = true;
                                 }

[Survived] BooleanLiteral
testing/se_js_hut_practice/src/hard.js:96:55
                                 view['default'] = false;
                                 if (view.id == id) {
                                     $scope.allResMarkDef = false;
-                                    view['default'] = true;
+                                    view['default'] = false;
                                 }
                             }

[Killed] StringLiteral
testing/se_js_hut_practice/src/hard.js:106:19
 
             $scope.deleteQuickViews = function(id) {
                 $('#over-lay, #jq-qv-chnl-popup').show();
-                $('.jq-deletequickview').off('click').on('click', function() {
+                $("").off('click').on('click', function() {
                     $('#over-lay, #jq-qv-chnl-popup').hide();
 

[Killed] StringLiteral
testing/se_js_hut_practice/src/hard.js:106:58
 
             $scope.deleteQuickViews = function(id) {
                 $('#over-lay, #jq-qv-chnl-popup').show();
-                $('.jq-deletequickview').off('click').on('click', function() {
+                $('.jq-deletequickview').off('click').on("", function() {
                     $('#over-lay, #jq-qv-chnl-popup').hide();
 

[Survived] StringLiteral
testing/se_js_hut_practice/src/hard.js:107:23
             $scope.deleteQuickViews = function(id) {
                 $('#over-lay, #jq-qv-chnl-popup').show();
                 $('.jq-deletequickview').off('click').on('click', function() {
-                    $('#over-lay, #jq-qv-chnl-popup').hide();
+                    $("").hide();
 
                     //Usagetracking

[Survived] StringLiteral
testing/se_js_hut_practice/src/hard.js:112:25
                     //Usagetracking
                     var shareInfo = getShareByUserTrack(FREnv.$rootScope.channelToRender);
                     usageTrackingCall(
-                        'deletequickview', id, 'stream', null, null, shareInfo.ss, 'quickview',
+                        "", id, 'stream', null, null, shareInfo.ss, 'quickview',
                         FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
                         null, null, shareInfo.ssi);

[Survived] StringLiteral
testing/se_js_hut_practice/src/hard.js:112:48
                     //Usagetracking
                     var shareInfo = getShareByUserTrack(FREnv.$rootScope.channelToRender);
                     usageTrackingCall(
-                        'deletequickview', id, 'stream', null, null, shareInfo.ss, 'quickview',
+                        'deletequickview', id, "", null, null, shareInfo.ss, 'quickview',
                         FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
                         null, null, shareInfo.ssi);
