[Survived] ArithmeticOperator
testing/se_js_hut_practice/src/hard.js:113:71
                     var shareInfo = getShareByUserTrack(FREnv.$rootScope.channelToRender);
                     usageTrackingCall(
                         'deletequickview', id, 'stream', null, null, shareInfo.ss, 'quickview',
-                        FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
+                        FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix - FREnv.$rootScope.channelToRender.id,
                         null, null, shareInfo.ssi);
 

[Killed] StringLiteral
testing/se_js_hut_practice/src/hard.js:116:31
                         FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
                         null, null, shareInfo.ssi);
 
-                    $http.get('deleteQuickView', {params: {
+                    $http.get("", {params: {
                         quickViewIds: id,
                         channelId: FREnv.$rootScope.channelToRender.id,

[Survived] BlockStatement
testing/se_js_hut_practice/src/hard.js:121:48
                         channelId: FREnv.$rootScope.channelToRender.id,
                         shareId: FREnv.$rootScope.channelToRender.shareId,
                     }})
-                        .success(function(res) {
-                            if (res) {
-                                successMessageSeachAdded('quick.view.delete');
-                                var views = $scope.views;
-                                for (var i in views) {
-                                    if (views[i].id == id) {
-                                        $scope.views.splice(i, 1);
-                                        var sqv = $scope.selectedQuickView;
-                                        if (sqv && sqv.id == id) {
-                                            $scope.removeQuickViewFilter();
-                                        }
-                                        return;
-                                    }
-                                }
-                            }
-                        });
+                        .success(function(res) {});
                 });
             };

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:122:33
                         shareId: FREnv.$rootScope.channelToRender.shareId,
                     }})
                         .success(function(res) {
-                            if (res) {
+                            if (true) {
                                 successMessageSeachAdded('quick.view.delete');
                                 var views = $scope.views;

[Survived] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:122:33
                         shareId: FREnv.$rootScope.channelToRender.shareId,
                     }})
                         .success(function(res) {
-                            if (res) {
+                            if (false) {
                                 successMessageSeachAdded('quick.view.delete');
                                 var views = $scope.views;

[Survived] StringLiteral
testing/se_js_hut_practice/src/hard.js:123:58
                     }})
                         .success(function(res) {
                             if (res) {
-                                successMessageSeachAdded('quick.view.delete');
+                                successMessageSeachAdded("");
                                 var views = $scope.views;
                                 for (var i in views) {

[Survived] BlockStatement
testing/se_js_hut_practice/src/hard.js:125:54
                             if (res) {
                                 successMessageSeachAdded('quick.view.delete');
                                 var views = $scope.views;
-                                for (var i in views) {
-                                    if (views[i].id == id) {
-                                        $scope.views.splice(i, 1);
-                                        var sqv = $scope.selectedQuickView;
-                                        if (sqv && sqv.id == id) {
-                                            $scope.removeQuickViewFilter();
-                                        }
-                                        return;
-                                    }
-                                }
+                                for (var i in views) {}
                             }
                         });

[Killed] EqualityOperator
testing/se_js_hut_practice/src/hard.js:126:41
                                 successMessageSeachAdded('quick.view.delete');
                                 var views = $scope.views;
                                 for (var i in views) {
-                                    if (views[i].id == id) {
+                                    if (views[i].id != id) {
                                         $scope.views.splice(i, 1);
                                         var sqv = $scope.selectedQuickView;

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:126:41
                                 successMessageSeachAdded('quick.view.delete');
                                 var views = $scope.views;
                                 for (var i in views) {
-                                    if (views[i].id == id) {
+                                    if (true) {
                                         $scope.views.splice(i, 1);
                                         var sqv = $scope.selectedQuickView;

[Killed] EqualityOperator
testing/se_js_hut_practice/src/hard.js:129:52
                                     if (views[i].id == id) {
                                         $scope.views.splice(i, 1);
                                         var sqv = $scope.selectedQuickView;
-                                        if (sqv && sqv.id == id) {
+                                        if (sqv && sqv.id != id) {
                                             $scope.removeQuickViewFilter();
                                         }

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:129:52
                                     if (views[i].id == id) {
                                         $scope.views.splice(i, 1);
                                         var sqv = $scope.selectedQuickView;
-                                        if (sqv && sqv.id == id) {
+                                        if (sqv && true) {
                                             $scope.removeQuickViewFilter();
                                         }

[Killed] BlockStatement
testing/se_js_hut_practice/src/hard.js:139:33
                         });
                 });
             };
-            var fn = function() {
-                $('.jq-filter-scroll-mqv').frvscroll({
-                    'load': 'none','touch': true,'fadeScrollbars': false,'scrollbars': 'custom'});
-                $('body').off('click.mqv');
-    
-                $('body').on('click.mqv',function(e) {
-                    if ($('#jq-qv-chnl-popup').is(':visible')) {
-                        return;
-                    }
-                    var _target = $(e.target);
-                
-                    if (_target.closest('#jq-m-qv').length === 0 && _target.closest('#jq-qv-chnl-popup').length === 0 &&
-                !$(e.target).hasClass('jq-fr-default')) {
-                    
-                        manageQuickViewDone();
-                    }
-                });
-                //Usagetracking
-                var shareInfo = getShareByUserTrack(FREnv.$rootScope.channelToRender);
-                usageTrackingCall(
-                    'managequickview', null, 'stream', null, null, shareInfo.ss, 'quickview',
-                    FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
-                    null, null, shareInfo.ssi);
-            };
+            var fn = function() {};
             setTimeout(fn , 100);
         }

[Survived] ObjectLiteral
testing/se_js_hut_practice/src/hard.js:140:54
                 });
             };
             var fn = function() {
-                $('.jq-filter-scroll-mqv').frvscroll({
-                    'load': 'none','touch': true,'fadeScrollbars': false,'scrollbars': 'custom'});
+                $('.jq-filter-scroll-mqv').frvscroll({});
                 $('body').off('click.mqv');
     

[Survived] StringLiteral
testing/se_js_hut_practice/src/hard.js:140:19
                 });
             };
             var fn = function() {
-                $('.jq-filter-scroll-mqv').frvscroll({
+                $("").frvscroll({
                     'load': 'none','touch': true,'fadeScrollbars': false,'scrollbars': 'custom'});
                 $('body').off('click.mqv');

[Survived] BooleanLiteral
testing/se_js_hut_practice/src/hard.js:141:45
             };
             var fn = function() {
                 $('.jq-filter-scroll-mqv').frvscroll({
-                    'load': 'none','touch': true,'fadeScrollbars': false,'scrollbars': 'custom'});
+                    'load': 'none','touch': false,'fadeScrollbars': false,'scrollbars': 'custom'});
                 $('body').off('click.mqv');
     

[Survived] BooleanLiteral
testing/se_js_hut_practice/src/hard.js:141:68
             };
             var fn = function() {
                 $('.jq-filter-scroll-mqv').frvscroll({
-                    'load': 'none','touch': true,'fadeScrollbars': false,'scrollbars': 'custom'});
+                    'load': 'none','touch': true,'fadeScrollbars': true,'scrollbars': 'custom'});
                 $('body').off('click.mqv');
     

[Killed] BlockStatement
testing/se_js_hut_practice/src/hard.js:144:54
                     'load': 'none','touch': true,'fadeScrollbars': false,'scrollbars': 'custom'});
                 $('body').off('click.mqv');
     
-                $('body').on('click.mqv',function(e) {
-                    if ($('#jq-qv-chnl-popup').is(':visible')) {
-                        return;
-                    }
-                    var _target = $(e.target);
-                
-                    if (_target.closest('#jq-m-qv').length === 0 && _target.closest('#jq-qv-chnl-popup').length === 0 &&
-                !$(e.target).hasClass('jq-fr-default')) {
-                    
-                        manageQuickViewDone();
-                    }
-                });
+                $('body').on('click.mqv',function(e) {});
                 //Usagetracking
                 var shareInfo = getShareByUserTrack(FREnv.$rootScope.channelToRender);

[Killed] StringLiteral
testing/se_js_hut_practice/src/hard.js:144:19
                     'load': 'none','touch': true,'fadeScrollbars': false,'scrollbars': 'custom'});
                 $('body').off('click.mqv');
     
-                $('body').on('click.mqv',function(e) {
+                $("").on('click.mqv',function(e) {
                     if ($('#jq-qv-chnl-popup').is(':visible')) {
                         return;

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:145:25
                 $('body').off('click.mqv');
     
                 $('body').on('click.mqv',function(e) {
-                    if ($('#jq-qv-chnl-popup').is(':visible')) {
+                    if (true) {
                         return;
                     }

[Survived] ConditionalExpression
testing/se_js_hut_practice/src/hard.js:145:25
                 $('body').off('click.mqv');
     
                 $('body').on('click.mqv',function(e) {
-                    if ($('#jq-qv-chnl-popup').is(':visible')) {
+                    if (false) {
                         return;
                     }

[Killed] LogicalOperator
testing/se_js_hut_practice/src/hard.js:150:25
                     }
                     var _target = $(e.target);
                 
-                    if (_target.closest('#jq-m-qv').length === 0 && _target.closest('#jq-qv-chnl-popup').length === 0 &&
-                !$(e.target).hasClass('jq-fr-default')) {
+                    if (_target.closest('#jq-m-qv').length === 0 && _target.closest('#jq-qv-chnl-popup').length === 0 || !$(e.target).hasClass('jq-fr-default')) {
                     
                         manageQuickViewDone();

[Killed] EqualityOperator
testing/se_js_hut_practice/src/hard.js:150:69
                     }
                     var _target = $(e.target);
                 
-                    if (_target.closest('#jq-m-qv').length === 0 && _target.closest('#jq-qv-chnl-popup').length === 0 &&
+                    if (_target.closest('#jq-m-qv').length === 0 && _target.closest('#jq-qv-chnl-popup').length !== 0 &&
                 !$(e.target).hasClass('jq-fr-default')) {
                     

[Killed] BlockStatement
testing/se_js_hut_practice/src/hard.js:151:57
                     var _target = $(e.target);
                 
                     if (_target.closest('#jq-m-qv').length === 0 && _target.closest('#jq-qv-chnl-popup').length === 0 &&
-                !$(e.target).hasClass('jq-fr-default')) {
-                    
-                        manageQuickViewDone();
-                    }
+                !$(e.target).hasClass('jq-fr-default')) {}
                 });
                 //Usagetracking

[Killed] BooleanLiteral
testing/se_js_hut_practice/src/hard.js:151:17
                     var _target = $(e.target);
                 
                     if (_target.closest('#jq-m-qv').length === 0 && _target.closest('#jq-qv-chnl-popup').length === 0 &&
-                !$(e.target).hasClass('jq-fr-default')) {
+                $(e.target).hasClass('jq-fr-default')) {
                     
                         manageQuickViewDone();

[Survived] ArithmeticOperator
testing/se_js_hut_practice/src/hard.js:160:67
                 var shareInfo = getShareByUserTrack(FREnv.$rootScope.channelToRender);
                 usageTrackingCall(
                     'managequickview', null, 'stream', null, null, shareInfo.ss, 'quickview',
-                    FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix + FREnv.$rootScope.channelToRender.id,
+                    FREnv.$rootScope.channelToRender.channelType, FREnv.channelPrefix - FREnv.$rootScope.channelToRender.id,
                     null, null, shareInfo.ssi);
             };

[Survived] BlockStatement
testing/se_js_hut_practice/src/hard.js:168:33
         ],
 
 
-        templateUrl: function() {
-            return FREnv.HTML_BASE_URL + '/manage-quick-view.html';
-        }
+        templateUrl: function() {}
     };
 });

[Survived] ArithmeticOperator
testing/se_js_hut_practice/src/hard.js:169:20
 
 
         templateUrl: function() {
-            return FREnv.HTML_BASE_URL + '/manage-quick-view.html';
+            return FREnv.HTML_BASE_URL - '/manage-quick-view.html';
         }
     };
