[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:4:9
 const $ = require('jquery');
 
 function buildTrendingAnalytics(res) {
-    if (res.data && res.data.visualizationData) {
+    if (false) {
         var contWidth = $('.jq-te-small-info').outerWidth();
         for (var chartType in res.data.visualizationData.chartTypeVsGraphMap) {

[Survived] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:4:9
 const $ = require('jquery');
 
 function buildTrendingAnalytics(res) {
-    if (res.data && res.data.visualizationData) {
+    if (true) {
         var contWidth = $('.jq-te-small-info').outerWidth();
         for (var chartType in res.data.visualizationData.chartTypeVsGraphMap) {

[Killed] UnaryOperator
testing/se_js_hut_practice/src/medium.js:8:25
         var contWidth = $('.jq-te-small-info').outerWidth();
         for (var chartType in res.data.visualizationData.chartTypeVsGraphMap) {
             var chartList = res.data.visualizationData.chartTypeVsGraphMap[chartType];
-            var count = -1;
+            var count = +1;
             for (var i in chartList) {
                 var graph = chartList[i];

[Killed] UpdateOperator
testing/se_js_hut_practice/src/medium.js:11:17
             var count = -1;
             for (var i in chartList) {
                 var graph = chartList[i];
-                count++;
+                count--;
                 if (graph.nodes) {
                     var id = '#jq-trending-graph-' + graph.chartType + '-' + count;

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:12:21
             for (var i in chartList) {
                 var graph = chartList[i];
                 count++;
-                if (graph.nodes) {
+                if (true) {
                     var id = '#jq-trending-graph-' + graph.chartType + '-' + count;
                     var chartName = null;

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:12:21
             for (var i in chartList) {
                 var graph = chartList[i];
                 count++;
-                if (graph.nodes) {
+                if (false) {
                     var id = '#jq-trending-graph-' + graph.chartType + '-' + count;
                     var chartName = null;

[Killed] ArithmeticOperator
testing/se_js_hut_practice/src/medium.js:13:30
                 var graph = chartList[i];
                 count++;
                 if (graph.nodes) {
-                    var id = '#jq-trending-graph-' + graph.chartType + '-' + count;
+                    var id = '#jq-trending-graph-' - graph.chartType + '-' + count;
                     var chartName = null;
                     if (res.data.mapSize == 1 && graph.entity) {

[Killed] ArithmeticOperator
testing/se_js_hut_practice/src/medium.js:13:30
                 var graph = chartList[i];
                 count++;
                 if (graph.nodes) {
-                    var id = '#jq-trending-graph-' + graph.chartType + '-' + count;
+                    var id = '#jq-trending-graph-' + graph.chartType - '-' + count;
                     var chartName = null;
                     if (res.data.mapSize == 1 && graph.entity) {

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:15:25
                 if (graph.nodes) {
                     var id = '#jq-trending-graph-' + graph.chartType + '-' + count;
                     var chartName = null;
-                    if (res.data.mapSize == 1 && graph.entity) {
+                    if (true) {
                         chartName = graph.entity.name;
                     } else {

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:15:64
                 if (graph.nodes) {
                     var id = '#jq-trending-graph-' + graph.chartType + '-' + count;
                     var chartName = null;
-                    if (res.data.mapSize == 1 && graph.entity) {
-                        chartName = graph.entity.name;
-                    } else {
+                    if (res.data.mapSize == 1 && graph.entity) {} else {
                         if (graph.chartType == 'TREE_COMPANY') {
                             chartName = 'BUSINESS INFLUENCERS';

[Survived] BlockStatement
testing/se_js_hut_practice/src/medium.js:17:28
                     var chartName = null;
                     if (res.data.mapSize == 1 && graph.entity) {
                         chartName = graph.entity.name;
-                    } else {
-                        if (graph.chartType == 'TREE_COMPANY') {
-                            chartName = 'BUSINESS INFLUENCERS';
-                        } else if (graph.chartType == 'TREE_TOPICS') {
-                            chartName = 'MARKET DRIVERS';
-                        } else if (graph.chartType == 'TREE_MONITOR_SEARCH') {
-                            chartName = 'MONITOR ACTIVITY TRENDS';
-                        } else {
-                            chartName = graph.entity.name;
-                        }
-                    }
+                    } else {}
                     if (chartName) {
                         $(id).parent().find('.jq-chrt-name').html(chartName);

[Killed] EqualityOperator
testing/se_js_hut_practice/src/medium.js:18:29
                     if (res.data.mapSize == 1 && graph.entity) {
                         chartName = graph.entity.name;
                     } else {
-                        if (graph.chartType == 'TREE_COMPANY') {
+                        if (graph.chartType != 'TREE_COMPANY') {
                             chartName = 'BUSINESS INFLUENCERS';
                         } else if (graph.chartType == 'TREE_TOPICS') {

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:18:29
                     if (res.data.mapSize == 1 && graph.entity) {
                         chartName = graph.entity.name;
                     } else {
-                        if (graph.chartType == 'TREE_COMPANY') {
+                        if (false) {
                             chartName = 'BUSINESS INFLUENCERS';
                         } else if (graph.chartType == 'TREE_TOPICS') {

[Killed] EqualityOperator
testing/se_js_hut_practice/src/medium.js:20:36
                     } else {
                         if (graph.chartType == 'TREE_COMPANY') {
                             chartName = 'BUSINESS INFLUENCERS';
-                        } else if (graph.chartType == 'TREE_TOPICS') {
+                        } else if (graph.chartType != 'TREE_TOPICS') {
                             chartName = 'MARKET DRIVERS';
                         } else if (graph.chartType == 'TREE_MONITOR_SEARCH') {

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:20:36
                     } else {
                         if (graph.chartType == 'TREE_COMPANY') {
                             chartName = 'BUSINESS INFLUENCERS';
-                        } else if (graph.chartType == 'TREE_TOPICS') {
+                        } else if (false) {
                             chartName = 'MARKET DRIVERS';
                         } else if (graph.chartType == 'TREE_MONITOR_SEARCH') {

[Survived] StringLiteral
testing/se_js_hut_practice/src/medium.js:21:41
                         if (graph.chartType == 'TREE_COMPANY') {
                             chartName = 'BUSINESS INFLUENCERS';
                         } else if (graph.chartType == 'TREE_TOPICS') {
-                            chartName = 'MARKET DRIVERS';
+                            chartName = "";
                         } else if (graph.chartType == 'TREE_MONITOR_SEARCH') {
                             chartName = 'MONITOR ACTIVITY TRENDS';

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:22:36
                             chartName = 'BUSINESS INFLUENCERS';
                         } else if (graph.chartType == 'TREE_TOPICS') {
                             chartName = 'MARKET DRIVERS';
-                        } else if (graph.chartType == 'TREE_MONITOR_SEARCH') {
+                        } else if (false) {
                             chartName = 'MONITOR ACTIVITY TRENDS';
                         } else {

[Killed] EqualityOperator
testing/se_js_hut_practice/src/medium.js:22:36
                             chartName = 'BUSINESS INFLUENCERS';
                         } else if (graph.chartType == 'TREE_TOPICS') {
                             chartName = 'MARKET DRIVERS';
-                        } else if (graph.chartType == 'TREE_MONITOR_SEARCH') {
+                        } else if (graph.chartType != 'TREE_MONITOR_SEARCH') {
                             chartName = 'MONITOR ACTIVITY TRENDS';
                         } else {

[Survived] BlockStatement
testing/se_js_hut_practice/src/medium.js:24:32
                             chartName = 'MARKET DRIVERS';
                         } else if (graph.chartType == 'TREE_MONITOR_SEARCH') {
                             chartName = 'MONITOR ACTIVITY TRENDS';
-                        } else {
-                            chartName = graph.entity.name;
-                        }
+                        } else {}
                     }
                     if (chartName) {

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:28:36
                             chartName = graph.entity.name;
                         }
                     }
-                    if (chartName) {
-                        $(id).parent().find('.jq-chrt-name').html(chartName);
-                    }
+                    if (chartName) {}
                     var _item = 3;
                     if (contWidth < 500) {

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:28:25
                             chartName = graph.entity.name;
                         }
                     }
-                    if (chartName) {
+                    if (false) {
                         $(id).parent().find('.jq-chrt-name').html(chartName);
                     }

[Survived] BlockStatement
testing/se_js_hut_practice/src/medium.js:32:42
                         $(id).parent().find('.jq-chrt-name').html(chartName);
                     }
                     var _item = 3;
-                    if (contWidth < 500) {
-                        _item = 1;
-                    }
+                    if (contWidth < 500) {}
                     var width = contWidth / _item - 36;
                     if (contWidth < 500) {

[Survived] EqualityOperator
testing/se_js_hut_practice/src/medium.js:32:25
                         $(id).parent().find('.jq-chrt-name').html(chartName);
                     }
                     var _item = 3;
-                    if (contWidth < 500) {
+                    if (contWidth <= 500) {
                         _item = 1;
                     }

[Survived] ArithmeticOperator
testing/se_js_hut_practice/src/medium.js:35:33
                     if (contWidth < 500) {
                         _item = 1;
                     }
-                    var width = contWidth / _item - 36;
+                    var width = contWidth / _item + 36;
                     if (contWidth < 500) {
                         //width -= 50;

[Survived] ArithmeticOperator
testing/se_js_hut_practice/src/medium.js:35:33
                     if (contWidth < 500) {
                         _item = 1;
                     }
-                    var width = contWidth / _item - 36;
+                    var width = contWidth * _item - 36;
                     if (contWidth < 500) {
                         //width -= 50;

[Survived] EqualityOperator
testing/se_js_hut_practice/src/medium.js:36:25
                         _item = 1;
                     }
                     var width = contWidth / _item - 36;
-                    if (contWidth < 500) {
+                    if (contWidth <= 500) {
                         //width -= 50;
                     }

[Survived] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:36:25
                         _item = 1;
                     }
                     var width = contWidth / _item - 36;
-                    if (contWidth < 500) {
+                    if (false) {
                         //width -= 50;
                     }

[Survived] ObjectLiteral
testing/se_js_hut_practice/src/medium.js:43:60
                     var height = 170;
                     $(id).html('');
 
-                    window.buildTreemapGraph($(id), graph, {
-                        width: width,
-                        height: height,
-                        index: count,
-                    });
+                    window.buildTreemapGraph($(id), graph, {});
                 }
             }

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:55:60
 }
 
 function constructActivityParamsInAjaxCall(data, params) {
-    if (data.activity != undefined && data.activity != '') {
-        params.activityType = data.activity;
-    }
+    if (data.activity != undefined && data.activity != '') {}
     if (data.target != undefined && data.target != '') {
         params.target = data.target;

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:55:9
 }
 
 function constructActivityParamsInAjaxCall(data, params) {
-    if (data.activity != undefined && data.activity != '') {
+    if (false) {
         params.activityType = data.activity;
     }

[Killed] EqualityOperator
testing/se_js_hut_practice/src/medium.js:58:9
     if (data.activity != undefined && data.activity != '') {
         params.activityType = data.activity;
     }
-    if (data.target != undefined && data.target != '') {
+    if (data.target == undefined && data.target != '') {
         params.target = data.target;
     }

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:58:56
     if (data.activity != undefined && data.activity != '') {
         params.activityType = data.activity;
     }
-    if (data.target != undefined && data.target != '') {
-        params.target = data.target;
-    }
+    if (data.target != undefined && data.target != '') {}
     if (data.targetId != undefined && data.targetId != '') {
         params.targetId = data.targetId;

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:61:60
     if (data.target != undefined && data.target != '') {
         params.target = data.target;
     }
-    if (data.targetId != undefined && data.targetId != '') {
-        params.targetId = data.targetId;
-    }
+    if (data.targetId != undefined && data.targetId != '') {}
 
     if (FREnv.inlineview) {

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:61:39
     if (data.target != undefined && data.target != '') {
         params.target = data.target;
     }
-    if (data.targetId != undefined && data.targetId != '') {
+    if (data.targetId != undefined && false) {
         params.targetId = data.targetId;
     }

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:65:9
         params.targetId = data.targetId;
     }
 
-    if (FREnv.inlineview) {
+    if (true) {
         params.activityView = FREnv.inlineview;
     } else {

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:65:27
         params.targetId = data.targetId;
     }
 
-    if (FREnv.inlineview) {
-        params.activityView = FREnv.inlineview;
-    } else {
+    if (FREnv.inlineview) {} else {
         params.activityView = FREnv.pageName;
     }

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:67:12
 
     if (FREnv.inlineview) {
         params.activityView = FREnv.inlineview;
-    } else {
-        params.activityView = FREnv.pageName;
-    }
+    } else {}
 
     if (FREnv.activityChannel) {

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:71:9
         params.activityView = FREnv.pageName;
     }
 
-    if (FREnv.activityChannel) {
+    if (false) {
         params.activityChannel = FREnv.activityChannel;
     }

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:71:32
         params.activityView = FREnv.pageName;
     }
 
-    if (FREnv.activityChannel) {
-        params.activityChannel = FREnv.activityChannel;
-    }
+    if (FREnv.activityChannel) {}
     if (data.viewId != undefined && data.viewId != '') {
         params.viewId = FREnv.channelPrefix + data.viewId;

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:74:9
     if (FREnv.activityChannel) {
         params.activityChannel = FREnv.activityChannel;
     }
-    if (data.viewId != undefined && data.viewId != '') {
+    if (false) {
         params.viewId = FREnv.channelPrefix + data.viewId;
     }

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:74:9
     if (FREnv.activityChannel) {
         params.activityChannel = FREnv.activityChannel;
     }
-    if (data.viewId != undefined && data.viewId != '') {
+    if (false && data.viewId != '') {
         params.viewId = FREnv.channelPrefix + data.viewId;
     }

[Killed] ArithmeticOperator
testing/se_js_hut_practice/src/medium.js:75:25
         params.activityChannel = FREnv.activityChannel;
     }
     if (data.viewId != undefined && data.viewId != '') {
-        params.viewId = FREnv.channelPrefix + data.viewId;
+        params.viewId = FREnv.channelPrefix - data.viewId;
     }
     //if section is not defined and subsection is present there then subsection becomes section

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:78:58
         params.viewId = FREnv.channelPrefix + data.viewId;
     }
     //if section is not defined and subsection is present there then subsection becomes section
-    if (data.section != undefined && data.section != '') {
-        params.section = data.section;
-    } else if (data.subSection != undefined && data.subSection != '') {
+    if (data.section != undefined && data.section != '') {} else if (data.subSection != undefined && data.subSection != '') {
         params.section = data.subSection;
         data.subSection = '';

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:78:38
         params.viewId = FREnv.channelPrefix + data.viewId;
     }
     //if section is not defined and subsection is present there then subsection becomes section
-    if (data.section != undefined && data.section != '') {
+    if (data.section != undefined && true) {
         params.section = data.section;
     } else if (data.subSection != undefined && data.subSection != '') {

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:80:16
     //if section is not defined and subsection is present there then subsection becomes section
     if (data.section != undefined && data.section != '') {
         params.section = data.section;
-    } else if (data.subSection != undefined && data.subSection != '') {
+    } else if (false) {
         params.section = data.subSection;
         data.subSection = '';

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:80:16
     //if section is not defined and subsection is present there then subsection becomes section
     if (data.section != undefined && data.section != '') {
         params.section = data.section;
-    } else if (data.subSection != undefined && data.subSection != '') {
+    } else if (false && data.subSection != '') {
         params.section = data.subSection;
         data.subSection = '';

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:84:62
         params.section = data.subSection;
         data.subSection = '';
     }
-    if (data.sectionId != undefined && data.sectionId != '') {
-        params.sectionId = data.sectionId;
-    } else {
+    if (data.sectionId != undefined && data.sectionId != '') {} else {
         params.sectionId = FREnv.sectionId;
     }

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:84:40
         params.section = data.subSection;
         data.subSection = '';
     }
-    if (data.sectionId != undefined && data.sectionId != '') {
+    if (data.sectionId != undefined && false) {
         params.sectionId = data.sectionId;
     } else {

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:86:12
     }
     if (data.sectionId != undefined && data.sectionId != '') {
         params.sectionId = data.sectionId;
-    } else {
-        params.sectionId = FREnv.sectionId;
-    }
+    } else {}
     if (data.subSection != undefined && data.subSection != '') {
         params.subSection = data.subSection;

[Killed] EqualityOperator
testing/se_js_hut_practice/src/medium.js:89:9
     } else {
         params.sectionId = FREnv.sectionId;
     }
-    if (data.subSection != undefined && data.subSection != '') {
+    if (data.subSection == undefined && data.subSection != '') {
         params.subSection = data.subSection;
     }

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:89:64
     } else {
         params.sectionId = FREnv.sectionId;
     }
-    if (data.subSection != undefined && data.subSection != '') {
-        params.subSection = data.subSection;
-    }
+    if (data.subSection != undefined && data.subSection != '') {}
     if (data.subSectionId != undefined && data.subSectionId != '') {
         params.subSectionId = data.subSectionId;

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:92:43
     if (data.subSection != undefined && data.subSection != '') {
         params.subSection = data.subSection;
     }
-    if (data.subSectionId != undefined && data.subSectionId != '') {
+    if (data.subSectionId != undefined && false) {
         params.subSectionId = data.subSectionId;
     }

[Killed] EqualityOperator
testing/se_js_hut_practice/src/medium.js:92:43
     if (data.subSection != undefined && data.subSection != '') {
         params.subSection = data.subSection;
     }
-    if (data.subSectionId != undefined && data.subSectionId != '') {
+    if (data.subSectionId != undefined && data.subSectionId == '') {
         params.subSectionId = data.subSectionId;
     }

[Killed] EqualityOperator
testing/se_js_hut_practice/src/medium.js:95:35
     if (data.subSectionId != undefined && data.subSectionId != '') {
         params.subSectionId = data.subSectionId;
     }
-    if (data.code != undefined && data.code != '') {
+    if (data.code != undefined && data.code == '') {
         params.code = data.code;
     }

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:95:52
     if (data.subSectionId != undefined && data.subSectionId != '') {
         params.subSectionId = data.subSectionId;
     }
-    if (data.code != undefined && data.code != '') {
-        params.code = data.code;
-    }
+    if (data.code != undefined && data.code != '') {}
     if (data.metadata != undefined && data.metadata != '') {
         params.metaData = data.metadata;

[Killed] EqualityOperator
testing/se_js_hut_practice/src/medium.js:98:9
     if (data.code != undefined && data.code != '') {
         params.code = data.code;
     }
-    if (data.metadata != undefined && data.metadata != '') {
+    if (data.metadata == undefined && data.metadata != '') {
         params.metaData = data.metadata;
     }

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:98:39
     if (data.code != undefined && data.code != '') {
         params.code = data.code;
     }
-    if (data.metadata != undefined && data.metadata != '') {
+    if (data.metadata != undefined && false) {
         params.metaData = data.metadata;
     }

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:101:52
     if (data.metadata != undefined && data.metadata != '') {
         params.metaData = data.metadata;
     }
-    if (data.str1 != undefined && data.str1 != '') {
-        params.str1 = data.str1;
-    }
+    if (data.str1 != undefined && data.str1 != '') {}
     if (data.str2 != undefined && data.str2 != '') {
         params.str2 = data.str2;

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:101:35
     if (data.metadata != undefined && data.metadata != '') {
         params.metaData = data.metadata;
     }
-    if (data.str1 != undefined && data.str1 != '') {
+    if (data.str1 != undefined && false) {
         params.str1 = data.str1;
     }

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:104:52
     if (data.str1 != undefined && data.str1 != '') {
         params.str1 = data.str1;
     }
-    if (data.str2 != undefined && data.str2 != '') {
-        params.str2 = data.str2;
-    }
+    if (data.str2 != undefined && data.str2 != '') {}
     params.track = 'true';
     params.email = FREnv.email;

[Killed] ConditionalExpression
testing/se_js_hut_practice/src/medium.js:104:35
     if (data.str1 != undefined && data.str1 != '') {
         params.str1 = data.str1;
     }
-    if (data.str2 != undefined && data.str2 != '') {
+    if (data.str2 != undefined && false) {
         params.str2 = data.str2;
     }

[Killed] BlockStatement
testing/se_js_hut_practice/src/medium.js:112:48
     params.token = FREnv.token;
 }
 
-function ajxCallToLogAction(data, requestType) {
-    $.ajax({
-        url: 'logaction',
-        cache: false,
-        type: requestType ? requestType : 'GET',
-        dataType: 'html',
-        data: data,
-    });
-}
+function ajxCallToLogAction(data, requestType) {}
 
 exports.buildTrendingAnalytics = buildTrendingAnalytics;

[Survived] StringLiteral
testing/se_js_hut_practice/src/medium.js:114:14
 
 function ajxCallToLogAction(data, requestType) {
     $.ajax({
-        url: 'logaction',
+        url: "",
         cache: false,
         type: requestType ? requestType : 'GET',

[Survived] BooleanLiteral
testing/se_js_hut_practice/src/medium.js:115:16
 function ajxCallToLogAction(data, requestType) {
     $.ajax({
         url: 'logaction',
-        cache: false,
+        cache: true,
         type: requestType ? requestType : 'GET',
         dataType: 'html',

[Killed] StringLiteral
testing/se_js_hut_practice/src/medium.js:116:43
     $.ajax({
         url: 'logaction',
         cache: false,
-        type: requestType ? requestType : 'GET',
+        type: requestType ? requestType : "",
         dataType: 'html',
         data: data,
